; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v8 - type_3 ?v3 - type_2)
 	      (pred_1 ?v6 - object ?v3 - type_2)
	      (pred_4 ?v8 - type_3 ?v4 - type_1)
	      (pred_3 ?v8 - type_3 ?v6 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v8 - type_3 ?v5 ?v7 - type_2)
       :precondition (and  (pred_2 ?v8 ?v5))
       :effect (and  (pred_2 ?v8 ?v7)
		     (not (pred_2 ?v8 ?v5))))

   (:action op_1
       :parameters (?v8 - type_3 ?v1 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v2) (pred_2 ?v8 ?v2) (pred_4 ?v8 ?v4))
       :effect (and (pred_3 ?v8 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v2)) 
		    (not (pred_4 ?v8 ?v4))))

   (:action op_3
       :parameters (?v8 - type_3 ?v1 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v1 ?v4) (pred_2 ?v8 ?v2))
       :effect (and (pred_1 ?v1 ?v2)
		    (pred_4 ?v8 ?v4)
		    (not (pred_3 ?v8 ?v1 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_07 - type_3
obj_03 obj_10 obj_06 obj_05 - type_1
obj_12 obj_04 obj_01 - type_2
obj_11 obj_09 obj_02 - object)
(:init
(pred_2 obj_08 obj_01)
(pred_4 obj_08 obj_03)
(pred_4 obj_08 obj_10)
(pred_2 obj_07 obj_04)
(pred_4 obj_07 obj_06)
(pred_4 obj_07 obj_05)
(pred_1 obj_11 obj_04)
(pred_1 obj_09 obj_01)
(pred_1 obj_02 obj_04)
)
(:goal
(and
(pred_1 obj_11 obj_01)
(pred_1 obj_09 obj_04)
(pred_1 obj_02 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_08 obj_01) (pred_2 obj_07 obj_01))))
  )
)
)

; plan
1. (op_1 obj_07 obj_02 obj_04 obj_05)
   deleted: (pred_1 obj_02 obj_04) (pred_4 obj_07 obj_05)
   added: (pred_3 obj_07 obj_02 obj_05)
   goals met: 0 of 3
2. (op_1 obj_07 obj_11 obj_04 obj_06)
   deleted: (pred_1 obj_11 obj_04) (pred_4 obj_07 obj_06)
   added: (pred_3 obj_07 obj_11 obj_06)
   goals met: 0 of 3
3. (op_1 obj_08 obj_09 obj_01 obj_10)
   deleted: (pred_1 obj_09 obj_01) (pred_4 obj_08 obj_10)
   added: (pred_3 obj_08 obj_09 obj_10)
   goals met: 0 of 3
4. (op_2 obj_08 obj_01 obj_04)
   deleted: (pred_2 obj_08 obj_01)
   added: (pred_2 obj_08 obj_04)
   goals met: 0 of 3
5. (op_2 obj_07 obj_04 obj_01)
   deleted: (pred_2 obj_07 obj_04)
   added: (pred_2 obj_07 obj_01)
   goals met: 0 of 3
6. (op_3 obj_07 obj_11 obj_01 obj_06)
   deleted: (pred_3 obj_07 obj_11 obj_06)
   added: (pred_1 obj_11 obj_01) (pred_4 obj_07 obj_06)
   goals met: 1 of 3
7. (op_3 obj_08 obj_09 obj_04 obj_10)
   deleted: (pred_3 obj_08 obj_09 obj_10)
   added: (pred_1 obj_09 obj_04) (pred_4 obj_08 obj_10)
   goals met: 2 of 3
8. (op_2 obj_07 obj_01 obj_12)
   deleted: (pred_2 obj_07 obj_01)
   added: (pred_2 obj_07 obj_12)
   goals met: 2 of 3
9. (op_3 obj_07 obj_02 obj_12 obj_05)
   deleted: (pred_3 obj_07 obj_02 obj_05)
   added: (pred_1 obj_02 obj_12) (pred_4 obj_07 obj_05)
   goals met: 3 of 3
